In [1]:
from __future__ import division 
import os,sys

import numpy as np
import pandas as pd
from pandas import Series,DataFrame

%matplotlib inline
import matplotlib.pyplot as plt

np.random.seed(12345)
np.set_printoptions(precision=4)
plt.rc('figure',figsize=(10,6))
br='\n'

In [2]:
a=[1,3,5]
print(a,type(a),br)

a=Series(a)
print(a,type(a))

[1, 3, 5] <class 'list'>

0    1
1    3
2    5
dtype: int64 <class 'pandas.core.series.Series'>

In [3]:
s=Series([4,7,-5,3])
s

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
s=Series([4,7,-5,3],index=['1','2','3','4'])
s

1    4
2    7
3   -5
4    3
dtype: int64

In [5]:
print(s.values,br)
print(s.index,br)

[ 4  7 -5  3]

Index(['1', '2', '3', '4'], dtype='object')

In [6]:
s2=Series([4,7,-5,3],index=['a','b','c','d'])
print(s2.values,br)
print(s2.index,br)

[ 4  7 -5  3]

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
s2['a']

4

In [8]:
print(s2['d'],br)
s2['d']=9
s2

3

a    4
b    7
c   -5
d    9
dtype: int64

In [9]:
print(s2[['c','a','d']])

c   -5
a    4
d    9
dtype: int64

In [10]:
s2

a    4
b    7
c   -5
d    9
dtype: int64

In [11]:
s2[s2>0]

a    4
b    7
d    9
dtype: int64

In [12]:
s2*2

a     8
b    14
c   -10
d    18
dtype: int64

In [13]:
np.exp(s2)

a      54.598150
b    1096.633158
c       0.006738
d    8103.083928
dtype: float64

In [14]:
print('b'in s2)
print('e'in s2)

True
False

In [15]:
sdata={'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
s3=Series(sdata)

print(s3,br)
print(s3.index,s3.values)

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

Index(['Ohio', 'Oregon', 'Texas', 'Utah'], dtype='object') [35000 16000 71000  5000]

In [16]:
states=['California','Ohio','Oregon','Texas']
sdata={'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
s4=Series(sdata,index=states)
s4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [17]:
pd.isnull(s4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [18]:
pd.notnull(s4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [19]:
#obj.isnull()
#obj.notnull()

In [20]:
s4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
s4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
print(s3,'\n',s4)
s3+s4

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64
 California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [23]:
s4.name='population'
s4.index.name='state'
s4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [24]:
print (s,br)
print(s.index,br)
s.index=['Bob','Steve','Jeff','Ryan']
s

1    4
2    7
3   -5
4    3
dtype: int64

Index(['1', '2', '3', '4'], dtype='object')

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [25]:
#DataFrame

In [26]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
     'year':[2000,2001,2002,2001,2002],
     'pop':[1.5,1.7,3.6,2.4,2.9]}
frame=DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [27]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [28]:
frame2=DataFrame(data,columns=['year','state','pop','debt'],
                index=['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [29]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [30]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [31]:
print(frame2.columns)
print(frame2.index)

Index(['year', 'state', 'pop', 'debt'], dtype='object')
Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [33]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [34]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [35]:
print(frame2.index)
frame2.loc['three']

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [36]:
print(frame2,br)
frame2['debt']=16555
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

       year   state  pop   debt
one    2000    Ohio  1.5  16555
two    2001    Ohio  1.7  16555
three  2002    Ohio  3.6  16555
four   2001  Nevada  2.4  16555
five   2002  Nevada  2.9  16555

In [37]:
frame2['debt']=np.arange(5.)*2
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   2.0
three  2002    Ohio  3.6   4.0
four   2001  Nevada  2.4   6.0
five   2002  Nevada  2.9   8.0

In [38]:
val=Series([-1.2,-1.5,-1.7],index=['two','four','five'])
print(frame2)
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   2.0
three  2002    Ohio  3.6   4.0
four   2001  Nevada  2.4   6.0
five   2002  Nevada  2.9   8.0

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [39]:
print(frame2.loc['one']['state'])
print(frame2['debt'][1])

Ohio
-1.2

In [40]:
frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [41]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [43]:
pop={'Nevada':{2001:2.4,2002:2.9},
    'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
print(pop)

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [44]:
frame3=DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [45]:
frame3.T#转置

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [46]:
pop={'Nevada':{2001:2.4,2002:2.9},
    'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
print(pop)
DataFrame(pop,index=[2001,2002,2003])
#DataFrame(frame3,index=[2001,2002,2003])

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

AttributeError: 'list' object has no attribute 'astype'

In [ ]:
print (frame3,br)
print (frame3['Ohio'][:-1])
pdata={'Ohio':frame3['Ohio'][:-1],
      'Nevada':frame3['Nevada'][:2]}
DataFrame(pdata)

In [ ]:
print (frame3.index.name)
frame3.index.name='year';
frame3.columns.name='state'
frame3

In [ ]:
frame3.values

In [ ]:
frame2.values

In [ ]:
obj=Series(list(range(3)),index=['a','b','c'])
index=obj.index
index

In [ ]:
index[1:]

In [ ]:
index[1]='d'
index

In [ ]:
index=pd.Index(np.arange(3))
s2=Series([1.5,-2.5,0],index=index)
s2.index is index

In [ ]:
index

In [ ]:
print (frame3)
print('Ohio' in frame3.columns)
print(2.4 in frame3.values)
print(2003 in frame3.index)

In [ ]:
s=Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
s2=s.reindex(['a','b','c','d','e'])
s2

In [ ]:
s3=s.reindex(['a','b','c','d','e'],fill_value=-1)
s3

In [ ]:
s2.reindex?

In [ ]:
s3=Series(['blue','purse','yellow'],index=[0,2,4])
s3.reindex(list(range(6)),method='ffill')

In [ ]:
#Series.reindex(range(6),method='ffill')
#method={None,'backfill'/'bfill','pad'/'ffill','nearest'}

In [ ]:
frame=DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],
                columns=['Ohio','Texas','California'])
frame

In [ ]:
frame2=frame.reindex(['a','b','c','d'])
frame2

In [ ]:
states=['Texas','Utah','California']
frame.reindex(columns=states)

In [ ]:
frame.reindex(index=['a','b','c','d'],method='ffill',columns=states.sort())

In [ ]:
frame

In [ ]:
frame.loc[['a','b','c','d'],states]

In [ ]:
s=Series(np.arange(5.),index=['a','b','c','d','e'])
new_s=s.drop('c')
new_s

In [ ]:
s.drop(['d','e'])

In [ ]:
data=DataFrame(np.arange(16).reshape((4,4)),
              index=['Ohio','Colorado','Utah','New York'],
              columns=['one','two','three','four'])
data

In [ ]:
data.drop('Colorado')

In [ ]:
data

In [ ]:
data.drop('two',axis=1)

In [ ]:
data.drop('two',axis=1)

In [ ]:
s=Series(np.arange(4.),index=['a','b','c','d'])
print(s['b'])
print(s[['b','c']])

In [ ]:
print(s[1])
print(s[2:4])
print(s[['b','a','d']])
print(s[[1,3]])

In [ ]:
s[s<2]

In [ ]:
s['b':'c']

In [ ]:
s['b':'c']=5
s

In [ ]:
data=DataFrame(np.arange(16).reshape((4,4)),
              index=['Ohio','Colorado','Utah','New York'],
              columns=['one','two','three','four'])
data

In [ ]:
data['two']

In [ ]:
data.loc['Colorado',['three','one']]

In [ ]:
print(data[0:1],br)
print(data[:2],br)
print(data[1:2])

In [ ]:
print(data,br)
data[data['three']>5]

In [ ]:
print(data,br)
print(data<5)

In [ ]:
data[data<5]=0
data

In [ ]:
data.loc['Colorado',['two','three']]

In [ ]:
data.loc['Colorado',['two','three']]

In [ ]:
data.iloc[2]

In [ ]:
data.iloc[2][1]

In [ ]:
data.ix[['Colorado','Utah'],[3,0,1]]

In [ ]:
data.iloc[2][1]

In [ ]:
data.loc[:'Utah','two']

In [ ]:
data.ix[data.three>5,:3]

In [ ]:
print(data,br)

In [ ]:
data.iloc[:1],br

In [ ]:
data.iloc[3],br

In [ ]:
data.xs('Utah'),br

In [ ]:
data.xs('one',axis=1),br

In [ ]:
import numpy as np
s=Series(np.arange(4.).index=['a','b','c','d'])
print(s['b'])
print(s['b','c'])

In [ ]:
data=DataFrame(np.arange(16).reshape((4,4)),
              index=['Ohio','Colorado','Utah','New York'],
              columns=['one','two','three','four'])
data

In [ ]:
data.two

In [ ]:
data[['three','one']]

In [ ]:
data.loc['Colorado',['three','one']]

In [ ]:
print(data[0:1],br)
print(data[:2],br)
print(data[1:2])

In [ ]:
print(data,br)

In [ ]:
print(data<5)

In [ ]:
data[data<5]=0
data

In [ ]:
data.loc['Colorado',['two','three']]

In [ ]:
data.loc['Colorado',['two','three']]

In [ ]:
data.iloc[2]

In [ ]:
data.iloc[2][1]

In [ ]:
data.ix[['Colorado','Uath'],[3,0,1]]

In [ ]:
data.iloc[2][1]

In [ ]:
data.loc[:'Utah','two']

In [ ]:
data.ix[data.three>5,:3]

In [ ]:
print (data,br)

In [ ]:
data.iloc[:,1],br

In [ ]:
data.iloc[3],br

In [ ]:
data.xs('Utah'),br

In [ ]:
data.xs('one',axis=1),br

In [ ]:
s1=Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2=Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])
s1+s2

In [ ]:
list('bcd')

In [ ]:
df1=DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),
             index=['Ohio','Texas','Colorado'])
df2=DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),
             index=['Utah','Ohio','Texas','Oregon'])
df1+df2

In [ ]:
arr=np.arange(12.).reshape((3,4))
arr

In [ ]:
arr[0]

In [ ]:
arr-arr[0]

In [ ]:
frame=DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),
               index=['Utah','Ohio','Texas','Oregon'])
frame

In [ ]:
series=frame.iloc[0]
series

In [ ]:
frame-series

In [ ]:
series2=Series(list(range(3)),index=['b','e','f'])
frame+series2

In [ ]:
frame-series2

In [ ]:
series3=frame['d']
frame

In [ ]:
frame.sub(series3,axis=0)

In [ ]:
frame=DataFrame(np.random.randn(4,3),columns=list('bde'),
               index=['Utah','Ohio','Texas','Oregon'])
frame

In [ ]:
np.abs(frame)

In [ ]:
f=lambda x:x.max()-x.min()

In [ ]:
print(frame,br)
frame.apply(f)

In [ ]:
frame.apply(f,axis=1)

In [ ]:
def f(x):
    return Series([x.min(),x.max()],index=['min','max'])
frame.apply(f)

In [ ]:
format=lambda x:'%.2f' %x
frame.applymap(format)

In [ ]:
frame['e'].map(format)

In [ ]:
s=Series(list(range(4)),index=['d','a','b','c'])
s.sort_index()

In [ ]:
frame=DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],
               columns=['d','a','b','c'])
print(frame.sort_index())
print(frame.sort_index(axis=1))
print(frame.sort_index(axis=1,ascending=False))

In [ ]:
s=Series([4,7,-3,2])
s.sort_values()

In [ ]:
frame=DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]},index=list('3012'))
print(frame)
print(frame.sort_index())
print(frame.sort_index(axis=1))
print(frame.sort_values(by='b'))
print(frame.sort_values(by=['a','b']))
print(frame.sort_values(by=['a','b'],ascending=False))

In [ ]:
s=Series([7,-5,7,4,2,0,4])
print(s.rank())
print(s.rank(method='first'))
print(s.rank(ascending=False,method='max'))

In [ ]:
frame=DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],
                'c':[-2,5,8,-2.5]})
print(frame)
frame.rank()

In [ ]:
frame.rank(axis=1)

In [ ]:
s=Series(list(range(5)),index=['a','a','b','b','c'])

In [ ]:
s.index.is_unique

In [ ]:
print(s['a'],type(s['a']))
print(s['c'],type(s['c']))

In [ ]:
df=DataFrame(np.random.randn(4,3),index=['a','a','b','c'])
print(df.loc['a'],type(df.loc['a']))
print(df.loc['c'],type(df.loc['c']))

In [ ]:
df=DataFrame([[1.4,np.nan],[7.1,-4.5],
             [np.nan,np.nan],[0.75,-1.3]],
            index=['a','b','c','d'],
            columns=['one','two'])
df

In [ ]:
df.sum()

In [ ]:
df.sum(axis=1)

In [ ]:
df.mean(axis=1,skipna=False)

In [ ]:
df.idxmax()

In [ ]:
df.cumsum()

In [ ]:
print(type(df.describe()),br)
df.describe()

In [ ]:
obj=Series(['a','a','b','c']*4)
print(obj,br)
obj.describe()

In [47]:
import pandas_datareader as pdr

In [48]:
from pandas_datareader import data,wb

In [49]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame
from pandas_datareader import data

all_stock={}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_stock[ticker]=data.get_data_yahoo(ticker,start='1/7/2017')
print(all_stock.items())

price =DataFrame({tic:data['close']
                 for tic,data in all_stock.items()})
volume=DataFrame({tic:data['volume']
                 for tic,data in all_stock.items()})
open=DataFrame({tic:data['open']
               for tic,data in all_stock.items()})
high=DataFrame({tic:data['high']
               for tic,data in all_stock.items()})
low=DataFrame({tic:data['low']
              for tic,data in all_stock.items()})

dict_items([('MSFT',                   High         Low        Open       Close      Volume  \
Date
2017-01-06   63.150002   62.040001   62.299999   62.840000  19922900.0
2017-01-09   63.080002   62.540001   62.759998   62.639999  20256600.0
2017-01-10   63.070000   62.279999   62.730000   62.619999  18593000.0
2017-01-11   63.230000   62.430000   62.610001   63.189999  21517300.0
2017-01-12   63.400002   61.950001   63.060001   62.610001  20968200.0
2017-01-13   62.869999   62.349998   62.619999   62.700001  19422300.0
2017-01-17   62.700001   62.029999   62.680000   62.529999  20620400.0
2017-01-18   62.700001   62.119999   62.669998   62.500000  19670100.0
2017-01-19   62.980000   62.200001   62.240002   62.299999  18451700.0
2017-01-20   62.820000   62.369999   62.669998   62.740002  30213500.0
2017-01-23   63.119999   62.570000   62.700001   62.959999  23097600.0
2017-01-24   63.740002   62.939999   63.200001   63.520000  24672900.0
2017-01-25   64.099998   63.450001   63.950001   63.680000  23672700.0
2017-01-26   64.540001   63.549999   64.120003   64.269997  43554600.0
2017-01-27   65.910004   64.889999   65.389999   65.779999  44818000.0
2017-01-30   65.790001   64.800003   65.690002   65.129997  31651400.0
2017-01-31   65.150002   64.260002   64.860001   64.650002  25270500.0
2017-02-01   64.620003   63.470001   64.360001   63.580002  39671500.0
2017-02-02   63.410000   62.750000   63.250000   63.169998  45827000.0
2017-02-03   63.700001   63.070000   63.500000   63.680000  30301800.0
2017-02-06   63.650002   63.139999   63.500000   63.639999  19796400.0
2017-02-07   63.779999   63.230000   63.740002   63.430000  20277200.0
2017-02-08   63.810001   63.220001   63.570000   63.340000  18096400.0
2017-02-09   64.440002   63.320000   63.520000   64.059998  22644400.0
2017-02-10   64.300003   63.980000   64.250000   64.000000  18170700.0
2017-02-13   64.860001   64.129997   64.239998   64.720001  22920100.0
2017-02-14   64.720001   64.019997   64.410004   64.570000  23065900.0
2017-02-15   64.570000   64.160004   64.500000   64.529999  17005200.0
2017-02-16   65.239998   64.440002   64.739998   64.519997  20546300.0
2017-02-17   64.690002   64.300003   64.470001   64.620003  21248800.0
...                ...         ...         ...         ...         ...
2018-08-24  108.559998  107.559998  107.669998  108.400002  17234000.0
2018-08-27  109.639999  108.510002  109.269997  109.599998  19662300.0
2018-08-28  110.500000  109.790001  109.940002  110.260002  19151500.0
2018-08-29  112.029999  110.269997  110.449997  112.019997  20818000.0
2018-08-30  112.610001  111.440002  111.669998  111.949997  22798700.0
2018-08-31  112.779999  111.519997  111.690002  112.330002  23222700.0
2018-09-04  111.959999  110.220001  110.849998  111.709999  22634600.0
2018-09-05  111.419998  108.099998  111.010002  108.489998  32872400.0
2018-09-06  108.989998  107.510002  108.250000  108.739998  23477600.0
2018-09-07  108.720001  107.230003  108.230003  108.209999  22498600.0
2018-09-10  109.639999  108.360001  108.839996  109.379997  20727900.0
2018-09-11  111.589996  108.889999  108.900002  111.239998  24301800.0
2018-09-12  111.849998  110.510002  111.430000  111.709999  18891100.0
2018-09-13  113.730003  112.120003  112.120003  112.910004  26055600.0
2018-09-14  113.730003  112.440002  113.360001  113.370003  19122300.0
2018-09-17  113.699997  111.860001  113.690002  112.139999  20736500.0
2018-09-18  113.699997  111.720001  112.190002  113.209999  22170900.0
2018-09-19  113.320000  111.040001  113.050003  111.699997  21728400.0
2018-09-20  113.800003  111.930000  112.279999  113.570000  23714500.0
2018-09-21  115.290001  113.510002  114.000000  114.260002  71229700.0
2018-09-24  114.900002  112.220001  113.029999  114.669998  27334500.0
2018-09-25  115.099998  113.750000  114.800003  114.449997  22668000.0
2018-09-26  115.059998  113.739998  114.470001  113.980003  19352000.0
2018-09-27  114.910004  114.199997  114.779999  114.410004  19091300.0
2018-09-28  114.570000  113.680000  114.190002  114.370003  21647800.0
2018-10-01  115.680000  114.730003  114.750000  115.610001  18883100.0
2018-10-02  115.839996  114.440002  115.300003  115.150002  20787200.0
2018-10-03  116.180000  114.930000  115.419998  115.169998  16648000.0
2018-10-04  114.760002  111.629997  114.610001  112.790001  34821700.0
2018-10-05  113.169998  110.639999  112.629997  112.129997  29064300.0

             Adj Close
Date
2017-01-06   60.682560
2017-01-09   60.489429
2017-01-10   60.470112
2017-01-11   61.020542
2017-01-12   60.460461
2017-01-13   60.547371
2017-01-17   60.383205
2017-01-18   60.354240
2017-01-19   60.161095
2017-01-20   60.585999
2017-01-23   60.798439
2017-01-24   61.339222
2017-01-25   61.493729
2017-01-26   62.063461
2017-01-27   63.521629
2017-01-30   62.893936
2017-01-31   62.430424
2017-02-01   61.397160
2017-02-02   61.001232
2017-02-03   61.493729
2017-02-06   61.455097
2017-02-07   61.252308
2017-02-08   61.165401
2017-02-09   61.860672
2017-02-10   61.802742
2017-02-13   62.498020
2017-02-14   62.731186
2017-02-15   62.692322
2017-02-16   62.682602
2017-02-17   62.779758
...                ...
2018-08-24  108.400002
2018-08-27  109.599998
2018-08-28  110.260002
2018-08-29  112.019997
2018-08-30  111.949997
2018-08-31  112.330002
2018-09-04  111.709999
2018-09-05  108.489998
2018-09-06  108.739998
2018-09-07  108.209999
2018-09-10  109.379997
2018-09-11  111.239998
2018-09-12  111.709999
2018-09-13  112.910004
2018-09-14  113.370003
2018-09-17  112.139999
2018-09-18  113.209999
2018-09-19  111.699997
2018-09-20  113.570000
2018-09-21  114.260002
2018-09-24  114.669998
2018-09-25  114.449997
2018-09-26  113.980003
2018-09-27  114.410004
2018-09-28  114.370003
2018-10-01  115.610001
2018-10-02  115.150002
2018-10-03  115.169998
2018-10-04  112.790001
2018-10-05  112.129997

[441 rows x 6 columns]), ('GOOG',                    High          Low         Open        Close   Volume  \
Date
2017-01-06   807.900024   792.203979   795.260010   806.150024  1640200
2017-01-09   809.966003   802.830017   806.400024   806.650024  1272400
2017-01-10   809.130005   803.510010   807.859985   804.789978  1176800
2017-01-11   808.150024   801.369995   805.000000   807.909973  1065900
2017-01-12   807.390015   799.169983   807.140015   806.359985  1353100
2017-01-13   811.223999   806.690002   807.479980   807.880005  1099200
2017-01-17   807.140015   800.369995   807.080017   804.609985  1355800
2017-01-18   806.205017   800.989990   805.809998   806.070007  1294400
2017-01-19   809.479980   801.799988   805.119995   802.174988   919300
2017-01-20   806.909973   801.690002   806.909973   805.020020  1670000
2017-01-23   820.869995   803.739990   807.250000   819.309998  1963600
2017-01-24   825.900024   817.820984   822.299988   823.869995  1474000
2017-01-25   835.770020   825.059998   829.619995   835.669983  1494500
2017-01-26   838.000000   827.010010   837.809998   832.150024  2973900
2017-01-27   841.950012   820.440002   834.710022   823.309998  2965800
2017-01-30   815.840027   799.799988   814.659973   802.320007  3246600
2017-01-31   801.250000   790.520020   796.859985   796.789978  2160600
2017-02-01   801.190002   791.190002   799.679993   795.695007  2029700
2017-02-02   802.700012   792.000000   793.799988   798.530029  1532100
2017-02-03   806.000000   800.369995   802.989990   801.489990  1463400
2017-02-06   801.669983   795.250000   799.700012   801.340027  1184500
2017-02-07   810.500000   801.780029   803.989990   806.969971  1241200
2017-02-08   811.840027   803.190002   807.000000   808.380005  1155300
2017-02-09   810.659973   804.539978   809.510010   809.559998   989700
2017-02-10   815.250000   809.780029   811.700012   813.669983  1135000
2017-02-13   820.958984   815.489990   816.000000   819.239990  1213300
2017-02-14   823.000000   816.000000   819.000000   820.450012  1053600
2017-02-15   823.000000   818.469971   819.359985   818.979980  1313600
2017-02-16   824.400024   818.979980   819.929993   824.159973  1287600
2017-02-17   828.070007   821.655029   823.020020   828.070007  1611000
...                 ...          ...          ...          ...      ...
2018-08-24  1221.650024  1206.359009  1208.819946  1220.650024   946600
2018-08-27  1243.089966  1225.715942  1227.599976  1241.819946  1156300
2018-08-28  1242.545044  1228.689941  1241.290039  1231.150024  1304000
2018-08-29  1250.660034  1236.359009  1237.449951  1249.300049  1298900
2018-08-30  1253.635010  1232.589966  1244.229980  1239.119995  1331400
2018-08-31  1238.660034  1211.285034  1234.979980  1218.189941  1816400
2018-09-04  1212.989990  1192.500000  1204.270020  1197.000000  1831000
2018-09-05  1199.010010  1162.000000  1193.800049  1186.479980  2061300
2018-09-06  1186.300049  1152.000000  1186.300049  1171.439941  1888500
2018-09-07  1175.260010  1157.214966  1158.670044  1164.829956  1401300
2018-09-10  1174.540039  1160.109985  1172.189941  1164.640015  1115400
2018-09-11  1178.680054  1156.239990  1161.630005  1177.359985  1209300
2018-09-12  1178.609985  1158.359985  1172.719971  1162.819946  1295500
2018-09-13  1178.609985  1162.849976  1170.739990  1175.329956  1431200
2018-09-14  1180.425049  1168.329956  1179.099976  1172.530029   944000
2018-09-17  1177.239990  1154.030029  1170.140015  1156.050049  1306500
2018-09-18  1176.079956  1157.089966  1157.089966  1161.219971  1203600
2018-09-19  1173.209961  1154.579956  1164.979980  1171.089966  1191400
2018-09-20  1189.890015  1173.359985  1179.989990  1186.869995  1210000
2018-09-21  1192.209961  1166.040039  1192.000000  1166.089966  4405600
2018-09-24  1178.000000  1146.910034  1157.170044  1173.369995  1271000
2018-09-25  1186.880005  1168.000000  1176.150024  1184.650024   977700
2018-09-26  1194.229980  1174.765015  1185.150024  1180.489990  1462300
2018-09-27  1202.099976  1183.630005  1186.729980  1194.640015  1260800
2018-09-28  1195.410034  1184.500000  1191.869995  1193.469971  1380600
2018-10-01  1209.900024  1190.300049  1199.890015  1195.310059  1357600
2018-10-02  1209.959961  1186.630005  1190.959961  1200.109985  1687900
2018-10-03  1206.410034  1193.829956  1205.000000  1202.949951  1256200
2018-10-04  1197.510010  1155.576050  1195.329956  1168.189941  2209500
2018-10-05  1173.500000  1145.119995  1167.500000  1157.349976  1184300

              Adj Close
Date
2017-01-06   806.150024
2017-01-09   806.650024
2017-01-10   804.789978
2017-01-11   807.909973
2017-01-12   806.359985
2017-01-13   807.880005
2017-01-17   804.609985
2017-01-18   806.070007
2017-01-19   802.174988
2017-01-20   805.020020
2017-01-23   819.309998
2017-01-24   823.869995
2017-01-25   835.669983
2017-01-26   832.150024
2017-01-27   823.309998
2017-01-30   802.320007
2017-01-31   796.789978
2017-02-01   795.695007
2017-02-02   798.530029
2017-02-03   801.489990
2017-02-06   801.340027
2017-02-07   806.969971
2017-02-08   808.380005
2017-02-09   809.559998
2017-02-10   813.669983
2017-02-13   819.239990
2017-02-14   820.450012
2017-02-15   818.979980
2017-02-16   824.159973
2017-02-17   828.070007
...                 ...
2018-08-24  1220.650024
2018-08-27  1241.819946
2018-08-28  1231.150024
2018-08-29  1249.300049
2018-08-30  1239.119995
2018-08-31  1218.189941
2018-09-04  1197.000000
2018-09-05  1186.479980
2018-09-06  1171.439941
2018-09-07  1164.829956
2018-09-10  1164.640015
2018-09-11  1177.359985
2018-09-12  1162.819946
2018-09-13  1175.329956
2018-09-14  1172.530029
2018-09-17  1156.050049
2018-09-18  1161.219971
2018-09-19  1171.089966
2018-09-20  1186.869995
2018-09-21  1166.089966
2018-09-24  1173.369995
2018-09-25  1184.650024
2018-09-26  1180.489990
2018-09-27  1194.640015
2018-09-28  1193.469971
2018-10-01  1195.310059
2018-10-02  1200.109985
2018-10-03  1202.949951
2018-10-04  1168.189941
2018-10-05  1157.349976

[441 rows x 6 columns]), ('AAPL',                   High         Low        Open       Close       Volume  \
Date
2017-01-06  118.160004  116.470001  116.779999  117.910004   31751900.0
2017-01-09  119.430000  117.940002  117.949997  118.989998   33561900.0
2017-01-10  119.379997  118.300003  118.769997  119.110001   24462100.0
2017-01-11  119.930000  118.599998  118.739998  119.750000   27588600.0
2017-01-12  119.300003  118.209999  118.900002  119.250000   27086200.0
2017-01-13  119.620003  118.809998  119.110001  119.040001   26111900.0
2017-01-17  120.239998  118.220001  118.339996  120.000000   34439800.0
2017-01-18  120.500000  119.709999  120.000000  119.989998   23713000.0
2017-01-19  120.089996  119.370003  119.400002  119.779999   25597300.0
2017-01-20  120.449997  119.730003  120.449997  120.000000   32597900.0
2017-01-23  120.809998  119.769997  120.000000  120.080002   22050200.0
2017-01-24  120.099998  119.500000  119.550003  119.970001   23211000.0
2017-01-25  122.099998  120.279999  120.419998  121.879997   32377600.0
2017-01-26  122.440002  121.599998  121.669998  121.940002   26337600.0
2017-01-27  122.349998  121.599998  122.139999  121.949997   20562900.0
2017-01-30  121.629997  120.660004  120.930000  121.629997   30377500.0
2017-01-31  121.389999  120.620003  121.150002  121.349998   49201000.0
2017-02-01  130.490005  127.010002  127.029999  128.750000  111985000.0
2017-02-02  129.389999  127.779999  127.980003  128.529999   33710400.0
2017-02-03  129.190002  128.160004  128.309998  129.080002   24507300.0
2017-02-06  130.500000  128.899994  129.130005  130.289993   26845900.0
2017-02-07  132.089996  130.449997  130.539993  131.529999   38183800.0
2017-02-08  132.220001  131.220001  131.350006  132.039993   23004100.0
2017-02-09  132.449997  131.119995  131.649994  132.419998   28349900.0
2017-02-10  132.940002  132.050003  132.460007  132.119995   20065500.0
2017-02-13  133.820007  132.750000  133.080002  133.289993   23035400.0
2017-02-14  135.089996  133.250000  133.470001  135.020004   33226200.0
2017-02-15  136.270004  134.619995  135.520004  135.509995   35623100.0
2017-02-16  135.899994  134.839996  135.669998  135.350006   22584600.0
2017-02-17  135.830002  135.100006  135.100006  135.720001   22198200.0
...                ...         ...         ...         ...          ...
2018-08-24  216.899994  215.110001  216.600006  216.160004   18476400.0
2018-08-27  218.740005  216.330002  217.149994  217.940002   20525100.0
2018-08-28  220.539993  218.919998  219.009995  219.699997   22776800.0
2018-08-29  223.490005  219.410004  220.149994  222.979996   27254800.0
2018-08-30  228.259995  222.399994  223.250000  225.029999   48793800.0
2018-08-31  228.869995  226.000000  226.509995  227.630005   43340100.0
2018-09-04  229.179993  226.630005  228.410004  228.360001   27390100.0
2018-09-05  229.669998  225.100006  228.990005  226.869995   33333000.0
2018-09-06  227.350006  221.300003  226.229996  223.100006   34290000.0
2018-09-07  225.369995  220.710007  221.850006  221.300003   37619800.0
2018-09-10  221.850006  216.470001  220.949997  218.330002   39516500.0
2018-09-11  224.300003  216.559998  218.009995  223.850006   35749000.0
2018-09-12  225.000000  219.839996  224.940002  221.070007   49278700.0
2018-09-13  228.350006  222.570007  223.520004  226.410004   41706400.0
2018-09-14  226.839996  222.520004  225.750000  223.839996   31999300.0
2018-09-17  222.949997  217.270004  222.149994  217.880005   37195100.0
2018-09-18  221.850006  217.119995  217.789993  218.240005   31571700.0
2018-09-19  219.619995  215.300003  218.500000  218.369995   27123800.0
2018-09-20  222.279999  219.149994  220.240005  220.029999   26608800.0
2018-09-21  221.360001  217.289993  220.779999  217.660004   96246700.0
2018-09-24  221.259995  216.630005  216.820007  220.789993   27693400.0
2018-09-25  222.820007  219.699997  219.750000  222.190002   24554400.0
2018-09-26  223.750000  219.759995  221.000000  220.419998   23984700.0
2018-09-27  226.440002  223.539993  223.820007  224.949997   30181200.0
2018-09-28  225.839996  224.020004  224.789993  225.740005   22929400.0
2018-10-01  229.419998  226.350006  227.949997  227.259995   23600800.0
2018-10-02  230.000000  226.630005  227.250000  229.279999   24788200.0
2018-10-03  233.470001  229.779999  230.050003  232.070007   28654800.0
2018-10-04  232.350006  226.729996  230.779999  227.990005   32042000.0
2018-10-05  228.410004  220.580002  227.960007  224.289993   33516700.0

             Adj Close
Date
2017-01-06  114.726402
2017-01-09  115.777237
2017-01-10  115.893997
2017-01-11  116.516708
2017-01-12  116.030212
2017-01-13  115.825882
2017-01-17  116.759972
2017-01-18  116.750229
2017-01-19  116.545898
2017-01-20  116.759972
2017-01-23  116.837799
2017-01-24  116.730774
2017-01-25  118.589195
2017-01-26  118.647583
2017-01-27  118.657303
2017-01-30  118.345947
2017-01-31  118.073517
2017-02-01  125.273705
2017-02-02  125.059654
2017-02-03  125.594803
2017-02-06  126.772125
2017-02-07  127.978630
2017-02-08  128.474869
2017-02-09  129.403229
2017-02-10  129.110077
2017-02-13  130.253418
2017-02-14  131.944016
2017-02-15  132.422836
2017-02-16  132.266495
2017-02-17  132.628067
...                ...
2018-08-24  216.160004
2018-08-27  217.940002
2018-08-28  219.699997
2018-08-29  222.979996
2018-08-30  225.029999
2018-08-31  227.630005
2018-09-04  228.360001
2018-09-05  226.869995
2018-09-06  223.100006
2018-09-07  221.300003
2018-09-10  218.330002
2018-09-11  223.850006
2018-09-12  221.070007
2018-09-13  226.410004
2018-09-14  223.839996
2018-09-17  217.880005
2018-09-18  218.240005
2018-09-19  218.369995
2018-09-20  220.029999
2018-09-21  217.660004
2018-09-24  220.789993
2018-09-25  222.190002
2018-09-26  220.419998
2018-09-27  224.949997
2018-09-28  225.740005
2018-10-01  227.259995
2018-10-02  229.279999
2018-10-03  232.070007
2018-10-04  227.990005
2018-10-05  224.289993

[441 rows x 6 columns]), ('IBM',                   High         Low        Open       Close      Volume  \
Date
2017-01-06  169.919998  167.520004  168.690002  169.529999   2945500.0
2017-01-09  169.800003  167.619995  169.470001  167.649994   3184700.0
2017-01-10  168.089996  165.339996  167.979996  165.520004   4118700.0
2017-01-11  167.759995  165.600006  166.050003  167.750000   3599500.0
2017-01-12  168.009995  165.559998  167.770004  167.949997   2927500.0
2017-01-13  168.479996  166.880005  167.970001  167.339996   2875400.0
2017-01-17  168.179993  166.119995  166.690002  167.889999   3302900.0
2017-01-18  168.589996  166.690002  167.449997  166.800003   4007800.0
2017-01-19  167.449997  165.800003  166.960007  166.809998   6963400.0
2017-01-20  170.639999  166.000000  167.809998  170.550003  12690000.0
2017-01-23  171.250000  170.009995  170.080002  171.029999   5478200.0
2017-01-24  176.000000  171.160004  171.360001  175.899994   6952400.0
2017-01-25  179.250000  176.130005  176.259995  178.289993   5922500.0
2017-01-26  178.880005  177.509995  178.059998  178.660004   3063900.0
2017-01-27  179.199997  177.300003  178.470001  177.300003   3482300.0
2017-01-30  177.070007  174.580002  176.979996  175.800003   4094800.0
2017-01-31  175.580002  173.610001  175.050003  174.520004   4139000.0
2017-02-01  175.699997  172.889999  175.000000  174.289993   2795700.0
2017-02-02  174.970001  173.550003  174.229996  174.580002   2620500.0
2017-02-03  176.339996  174.889999  175.000000  175.820007   3309300.0
2017-02-06  175.979996  174.380005  175.309998  175.860001   2650800.0
2017-02-07  178.619995  175.899994  176.000000  178.460007   3873500.0
2017-02-08  177.500000  175.880005  177.500000  176.169998   2913100.0
2017-02-09  177.800003  175.910004  176.169998  177.210007   3090700.0
2017-02-10  178.869995  176.759995  177.369995  178.679993   2930700.0
2017-02-13  179.899994  178.839996  179.240005  179.360001   3093400.0
2017-02-14  180.130005  178.350006  178.570007  180.130005   2567900.0
2017-02-15  181.919998  179.809998  180.199997  181.679993   2914300.0
2017-02-16  182.789993  180.869995  181.449997  181.429993   3251500.0

KeyError: 'close'

In [50]:
volume.head()

NameError: name 'volume' is not defined

In [51]:
price.head()

NameError: name 'price' is not defined

In [52]:
price.tail()

NameError: name 'price' is not defined

In [53]:
obj=Series(['c','a','d','a','a','b','b','c','c'])

In [54]:
uinques=obj.unique()
uinques

array(['c', 'a', 'd', 'b'], dtype=object)

In [55]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [56]:
pd.value_counts(obj.values,sort=False)

d    1
a    3
b    2
c    3
dtype: int64

In [57]:
mask=obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [58]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [59]:
data=DataFrame({'Qu1':[1,3,4,3,4],
               'Qu2':[2,3,1,2,3],
               'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [60]:
data.Qu1.value_counts()

4    2
3    2
1    1
Name: Qu1, dtype: int64

In [61]:
pd.value_counts(data.Qu2,sort=True)

3    2
2    2
1    1
Name: Qu2, dtype: int64

In [62]:
print(data,br)
result=data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [63]:
string_data=Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [64]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [65]:
string_data[0]=None
print(string_data[0])
string_data.isnull()

None

0     True
1    False
2     True
3    False
dtype: bool

In [66]:
from numpy import nan as NA
data=Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [67]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [68]:
data=DataFrame([[1.,6.5,3],[1.,NA,NA],
               [NA,NA,NA],[NA,6.5,3.]])
clearned=data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [69]:
clearned

     0    1    2
0  1.0  6.5  3.0

In [70]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [71]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [72]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [73]:
df=DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA;df.iloc[:2,2]=NA
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [74]:
df.dropna(thresh=2)

          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [75]:
print(df,br)
df.fillna(0)

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [76]:
df.fillna({1:0.5,2:-1})

          0         1         2
0 -0.204708  0.500000 -1.000000
1 -0.555730  0.500000 -1.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [77]:
print(df,br)
_=df.fillna(0,inplace=True)
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [79]:
from pandas import DataFrame,Series
df.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA;df.iloc[4:,2]=NA
df

AttributeError: 'DataFrame' object has no attribute 'DataFrame'

In [80]:
df.fillna(method='ffill')

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741